/* Why do I should learn Node.js?

Background
  - React == JS의 라이브러리
  - JS 코드는 웹 브라우저 내장 JS 엔진을 이용하여 실행 => JS는 브라우저에서만 실행 가능
  - 크롬 브라우저의 V8 엔진이 가장 유명
  - 브라우저는 HTML 문서를 기반으로 동작 => 웹 사이트의 이벤트 핸들링 등에 사용되는 언어
  - 이렇게 편하고 좋은 JS를 브라우저 안에서만 쓰기 아까움
  - 크롬의 V8 엔진은 C++로 개발되어 브라우저 내부가 아니더라도 어디서나 사용 가능
  - 개발자들이 V8 엔진을 브라우저로부터 독립시킴
  - 브라우저로부터 독립한 V8 엔진을 통해 JS를 브라우저가 아닌 어디서나 사용할 수 있게 만드는 프로젝트 진행
*/

/*
Node.js
  -> 크롬의 JS 엔진인 V8 엔진을 이용하여 JS를 브라우저가 아닌 어디에서든 사용할 수 있도록 만들어주는 JS의 실행 환경 => JS의 Runtime

=> JS로 웹 서버 개발 가능
*/
